## Displaying avaible routes

```

# show all the routers
R1(config)# show ip route

# show only static route
R1(config)# show ip route static

# show only ospf route
R1(config)# show ip route ospf

# show eigrp routes
R1(config)# show ip route eigrp


# show routing topology for example eigrp
R1(config)# show ip eigrp topology
```
